{
  "main": {
    "name":"Purity Ruth",
    "description": "I am a Full Stack Developer with expertise in React, Python, Django, Laravel, Angular, and Vue.js. With strong experience in team leadership, project management, and DevOps practices, I drive successful project delivery and team collaboration. I manage the full development lifecycle, from design to deployment, ensuring high-quality applications. Additionally, I have expertise in SEO to optimize web performance and visibility.",
    "image":"profilepic1.jpg",
    "bio":"I am a creative, goal-oriented, and innovative professional with strong leadership and team management abilities. Known for my commitment to ensuring things work perfectly and as intended, I focus on delivering high-level results while meeting deadlines. I excel at guiding teams to success, fostering collaboration, and empowering individuals to reach their full potential. With a keen understanding of client needs, I use my skills to align projects with expectations, ensuring satisfaction. I am passionate about leveraging technology to solve problems and continuously strive to provide the best solutions.",
    "contactmessage":"Please write your message here to get in touch with me.",
    "email": "purityruth09@gmail.com",
    "phone": "+254746862634",
    "github":"https://github.com/purityruth",
    "project":"https://www.linkedin.com/in/purity-ruth-3940b9227/",
    "address":{
      "street":"Nairobi",
      "city":"Nairobi",
      "state":", Kenya",
      "zip": "681-00216"
    },
    "website": "http://www.purityruth.co.ke",
    "resumedownload":"http://purityruth.com",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/purity-ruth-3940b9227/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/_purity_ruth/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/purityruth/",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"A short write-up of my skills is as described below",
    "education":[
      {
        "school":"Chuka University",
        "degree":"Bachelor of Science in Computer Science",
        "graduated":"October 2022",
        "description":"I have a bachelor's degree in Computer science, I acquired knowledge in most used programming languages such as C, C++, Java, Python, PHP, HTML, CSS and JavaScript, as well as database management using MySql, MongoDB and Postgress. I am also familiar with discrete structures, Operating systems, Networking, Data structures and algorithms, blockchain technology, data science and cyber security. I have good skills in Web development, using most of well known javascript frameworks such as React js and Agular for client side applications, Django and Laravel frameworks for server side applications."
      },
      {
        "school":"Sister of Mercy Commercial College",
        "degree":"Computer Packages",
        "graduated":"May 2018",
        "description":"This is where I got a good interaction with what computers and technology can do, therefore developed my interest in pursuing a degree in an Information Technology related field."
      }
    ],
    "work": [
      {
        "company": "BARIZI COMMUNICATIONS",
        "title": "Lead Software Developer",
        "years": "May 2024 – Present",
        "description": "Leading software development initiatives, ensuring project alignment with goals and timelines. Overseeing CI/CD pipeline implementation, DevOps practices, and cloud deployments. Managing cross-functional collaboration with stakeholders to deliver high-quality software solutions. Conducting code reviews and integrating innovative technologies to enhance efficiency and scalability."
      },
      {
        "company": "PICKUP MTAANI",
        "title": "Team Lead/Project Manager",
        "years": "February 2024 – May 2024",
        "description": "Led the development team to ensure core system functionality and performance. Optimized development workflows, conducted code reviews, and enforced best practices. Managed QA efforts, ensuring reliable system performance and timely delivery of updates."
      },
      {
        "company": "DEMAND SOLUTIONS LTD - TUNYCE MEDIA",
        "title": "Lead Senior Developer",
        "years": "July 2023 – February 2024",
        "description": "Supervised a team of developers, offering guidance and mentorship. Designed and implemented scalable software solutions. Collaborated with project managers, designers, and QA engineers to enhance communication and project execution. Conducted code reviews, shared best practices, and drove process improvements."
      },
      {
        "company": "COSEKE KENYA",
        "title": "Software Developer",
        "years": "April 2021 – July 2023",
        "description": "Developed and maintained web applications using JavaScript and Python. Led cloud migration initiatives using AWS and Docker, reducing infrastructure costs by 40%. Built and maintained RESTful APIs for high-performance applications. Provided system support, troubleshooting, training, and documentation. Ensured software quality through continuous integration and QA processes."
      },
      {
        "company": "JBS FOR SCHOOLS",
        "title": "Software Engineer/ Hardware Engineer",
        "years": "April 2019 – March 2020",
        "description": "Implemented secure authentication systems using OAuth 2.0. Developed biometric registration and verification services. Designed and tested software applications. Configured and managed network equipment, including routers and security appliances. Provided system maintenance, troubleshooting, and client support."
      },
      {
        "company": "GEOMIN TECHNICAL WORKS",
        "title": "Assistant Network Administrator/Assistant Hardware Engineer",
        "years": "June 2018 – March 2019",
        "description": "Collected and stored system data, including CCTV footage. Performed system maintenance, troubleshooting, and data verification. Assembled and repaired computer hardware components."
      }
    ],

    "skills": [
      {
        "title": "Software Development & Engineering",
        "description": "- Proficient in Python, JavaScript (ReactJS, Angular), PHP, Java, and C++\n- Strong expertise in frontend and backend frameworks for full-stack development\n- Experience in API design, microservices architecture, and RESTful services"
      },
      {
        "title": "DevOps & Cloud Engineering",
        "description": "- Experienced with AWS, Azure, and Google Cloud Platform\n- CI/CD pipeline setup with GitHub Actions, Jenkins, and Docker\n- Infrastructure as Code (IaC) using Terraform and Kubernetes\n- Strong expertise in cloud architecture and automation practices"
      },
      {
        "title": "Database Management & Optimization",
        "description": "- Expertise in SQL (MySQL, PostgreSQL, MSSQL) and NoSQL databases (MongoDB, Firebase)\n- Performance optimization, indexing, and database scaling strategies\n- Data security and compliance best practices"
      },
      {
        "title": "AI & Machine Learning",
        "description": "- Proficient in TensorFlow, PyTorch, and Scikit-Learn\n- Model training, NLP, and computer vision\n- AI-powered automation and predictive analytics"
      },
      {
        "title": "Cybersecurity & Data Protection",
        "description": "- Security best practices, encryption, and secure coding\n- Vulnerability assessments and penetration testing\n- Compliance with GDPR, HIPAA, and other security standards"
      },
      {
        "title": "Leadership & Technical Strategy",
        "description": "- CTO-level experience in leading cross-functional development teams\n- Technology strategy, digital transformation, and business growth through tech innovation\n- Agile development methodologies, team mentoring, and project management"
      }
    ],
    
    "stacks":[
      {
        "name":"Python",
        "level":"80%"
      },
      {
        "name":"Angular",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"65%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"PHP",
        "level":"80%"
      },
      {
        "name":"JavaScript",
        "level":"70%"
      },
      {
        "name":"JAVA",
        "level":"50%"
      },
      {
        "name":"C++",
        "level":"55%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"ECabinet System",
        "category":"An eboard system tailor made for the board meetings in all cabinet offices in Kenya",
        "image":"ecabinet.png",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Eboard System",
        "category":"An eboard system for meetings management for the board members",
        "image":"coseke.png",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"P&E Real Estate",
        "category":"A React based real estate system for listing properties",
        "image":"estate.png",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"CMSME Club",
        "category":"Legal Services for SMEs Website",
        "image":"cmsme.png",
        "url":"https://cmsmeclub.com/"
      },
      {
        "title":"CMSME Portal",
        "category":"CMSME Portal for subscription legal services",
        "image":"portal.png",
        "url":"https://portal.cmsmeclub.com/"
      },
      {
        "title":"CM Diaspora & Expatriates",
        "category":"Website I built for legal services for Kenyan clients in the diaspora & expatriates",
        "image":"cmdiaspora.png",
        "url":"https://cmdiaspora-expats.com/"
      },
      {
        "title":"Tunyce Media",
        "category":"(MVP Only) An entertainment platform, livestreaming and ads enabled.",
        "image":"tunyce.png",
        "url":"http://www.smirkspace.com"
      },
      {
        "title":"Canadian Wanderlust",
        "category":"My Beauty management system, for project portfolio purposes.",
        "image":"beauty.png",
        "url":"https://www.canadianwanderlust.com"
      }
    ]
  }
}
